faq_data = [
    {"topic": "শিক্ষা", "difficulty": "easy",
     "question": "শিক্ষা কী?",
     "answer": "শিক্ষা হলো জ্ঞান ও দক্ষতা অর্জনের প্রক্রিয়া।"},

    {"topic": "শিক্ষা", "difficulty": "medium",
     "question": "অনলাইন শিক্ষার সুবিধা কী?",
     "answer": "অনলাইন শিক্ষা ঘরে বসে শেখার সুযোগ দেয়।"},

    {"topic": "শিক্ষা", "difficulty": "easy",
     "question": "শিক্ষার গুরুত্ব কী?",
     "answer": "শিক্ষা মানুষকে সচেতন ও দক্ষ করে তোলে।"},

    {"topic": "স্বাস্থ্য", "difficulty": "easy",
     "question": "স্বাস্থ্যকর জীবন কী?",
     "answer": "সুষম খাদ্য ও ব্যায়াম স্বাস্থ্যকর জীবনের অংশ।"},

    {"topic": "স্বাস্থ্য", "difficulty": "medium",
     "question": "ডায়াবেটিস কী?",
     "answer": "ডায়াবেটিস রক্তে শর্করার মাত্রা বেড়ে যাওয়া।"},

    {"topic": "স্বাস্থ্য", "difficulty": "easy",
     "question": "ঘুম কেন জরুরি?",
     "answer": "ঘুম শরীর ও মস্তিষ্ক সুস্থ রাখে।"},

    {"topic": "ভ্রমণ", "difficulty": "easy",
     "question": "ভ্রমণ কেন দরকার?",
     "answer": "ভ্রমণ মানসিক প্রশান্তি দেয়।"},

    {"topic": "ভ্রমণ", "difficulty": "medium",
     "question": "ভ্রমণে কী নেওয়া উচিত?",
     "answer": "প্রয়োজনীয় কাগজপত্র ও ওষুধ নেওয়া উচিত।"},

    {"topic": "ভ্রমণ", "difficulty": "easy",
     "question": "বাংলাদেশের জনপ্রিয় ভ্রমণ স্থান কী?",
     "answer": "কক্সবাজার ও সুন্দরবন জনপ্রিয়।"},

    {"topic": "প্রযুক্তি", "difficulty": "easy",
     "question": "কৃত্রিম বুদ্ধিমত্তা কী?",
     "answer": "AI মানুষের মতো চিন্তা করতে পারে।"},

    {"topic": "প্রযুক্তি", "difficulty": "medium",
     "question": "রোবট কী?",
     "answer": "রোবট একটি স্বয়ংক্রিয় যন্ত্র।"},

    {"topic": "প্রযুক্তি", "difficulty": "easy",
     "question": "ইন্টারনেট কী?",
     "answer": "ইন্টারনেট তথ্য আদান-প্রদানের মাধ্যম।"},

    {"topic": "খেলাধুলা", "difficulty": "easy",
     "question": "বাংলাদেশের জাতীয় খেলা কী?",
     "answer": "বাংলাদেশের জাতীয় খেলা কাবাডি।"},

    {"topic": "খেলাধুলা", "difficulty": "medium",
     "question": "ক্রিকেট কেন জনপ্রিয়?",
     "answer": "ক্রিকেট উত্তেজনাপূর্ণ খেলা।"},

    {"topic": "খেলাধুলা", "difficulty": "easy",
     "question": "খেলাধুলার উপকারিতা কী?",
     "answer": "খেলাধুলা শরীর সুস্থ রাখে।"},
]
